#Область ПубличныйИнтерфейс

Функция ПоставитьВОчередь(
	ВидОбмена,
	Топик,
	ИдентификаторСообщения,
	КлючСообщения,
	Тело,
	Заголовки = Неопределено,
	ИдентификаторПакета = "") Экспорт

	Сообщение = KafkaИнтеграцияКонтракты.НовоеИсходящееСообщение(
		ВидОбмена,
		ИдентификаторСообщения,
		Топик,
		КлючСообщения,
		Тело,
		Заголовки,
		ИдентификаторПакета);
	Возврат KafkaИнтеграцияХранилище.ДобавитьЕслиОтсутствует(Сообщение);

КонецФункции

Функция НовыйИдентификаторСообщения() Экспорт

	Возврат Строка(Новый УникальныйИдентификатор);

КонецФункции

#КонецОбласти
